<?php

return [
//    默认看守
    'defaults' => [
        'guard' => 'web',
        'passwords' => 'users',
    ],

//    看守器
    'guards' => [
        'web' => [
            'driver' => 'session',
            'provider' => 'users',
        ],

        'api' => [
            'driver' => 'token',
            'provider' => 'users',
            'hash' => false,
        ],
    ],

//    用户提供者
    'providers' => [
        'users' => [
            'driver' => 'model',
            'model' => \Lunzi\TopAuth\Models\User::class,
        ],
    ],


    /*
    |--------------------------------------------------------------------------
    | 默认登录、注册路由
    |--------------------------------------------------------------------------
    |
    | 配置规则：'标识' => '控制器/操作'
    |
    */
    'route' => [
        'login' => 'Account/login',
        'register' => 'Account/register'
    ],

    /*
    |--------------------------------------------------------------------------
    | 登录、注册路由别名
    |--------------------------------------------------------------------------
    |
    | 配置规则：'标识' => '控制器/操作'
    |
    */
    'route_alias' => [
        'login' => 'Account/login',
        'register' => 'Account/register'
    ],

    /*
    |--------------------------------------------------------------------------
    | 白名单路由
    |--------------------------------------------------------------------------
    |
    | 如果把中间件放在全局路由中，配置此项可绕过登录检查
    | 配置规则: '控制器/操作'
    |
    */
    'white_list_route' => [
//        例如：
//    'About/team',
//    'About/contact',
    ]
];
